<center>
    <img src="https://gitlab.com/ibm/skills-network/courses/placeholder101/-/raw/master/labs/module%201/images/IDSNlogo.png"  width="300" alt="cognitiveclass.ai logo"  />
</center>

<h1 align=center><font size = 5>Assignment: SQL Notebook for Peer Assignment</font></h1>

Estimated time needed: **60** minutes.

## Introduction

Using this Python notebook you will:

1.  Understand the Spacex DataSet
2.  Load the dataset  into the corresponding table in a Db2 database
3.  Execute SQL queries to answer assignment questions

## Overview of the DataSet

SpaceX has gained worldwide attention for a series of historic milestones.

It is the only private company ever to return a spacecraft from low-earth orbit, which it first accomplished in December 2010.
SpaceX advertises Falcon 9 rocket launches on its website with a cost of 62 million dollars wheras other providers cost upward of 165 million dollars each, much of the savings is because Space X can reuse the first stage.

Therefore if we can determine if the first stage will land, we can determine the cost of a launch.

This information can be used if an alternate company wants to bid against SpaceX for a rocket launch.

This dataset includes a record for each payload carried during a SpaceX mission into outer space.

### Download the datasets

This assignment requires you to load the spacex dataset.

In many cases the dataset to be analyzed is available as a .CSV (comma separated values) file, perhaps on the internet. Click on the link below to download and save the dataset (.CSV file):

<a href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBM-DS0321EN-SkillsNetwork/labs/module_2/data/Spacex.csv?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDS0321ENSkillsNetwork26802033-2021-01-01" target="_blank">Spacex DataSet</a>

In [ ]:
!pip install sqlalchemy==1.3.9
!pip install ibm_db_sa
!pip install ipython-sql

### Connect to the database

Let us first load the SQL extension and establish a connection with the database

In [12]:
import pandas as pd
import sqlite3

In [56]:
# Read sqlite query results into a pandas DataFrame
con = sqlite3.connect("space_data2.sql")

In [71]:
# Verify that result of SQL query is stored in the dataframe
#print(df.head())

con.close()

## Tasks

Now write and execute SQL queries to solve the assignment tasks.

### Task 1

##### Display the names of the unique launch sites  in the space mission

In [2]:
# could not get db2 console to work so solutions are implemented with Pandas and a locally provisioned SQLite database
data = pd.read_csv('https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBM-DS0321EN-SkillsNetwork/labs/module_2/data/Spacex.csv?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDS0321ENSkillsNetwork26802033-2021-01-01')

In [ ]:
data.head()

In [4]:
data.Launch_Site.unique() # SELECT DISTINCT(Launch_Site) FROM TABLE

array(['CCAFS LC-40', 'VAFB SLC-4E', 'KSC LC-39A', 'CCAFS SLC-40'],
      dtype=object)

In [13]:
task1 = pd.read_sql_query("SELECT DISTINCT(Launch_Site) FROM spacex", con)
task1

    Launch_Site
0   CCAFS LC-40
1   VAFB SLC-4E
2    KSC LC-39A
3  CCAFS SLC-40

### Task 2

##### Display 5 records where launch sites begin with the string 'CCA'

In [6]:
data.loc[~data['Launch_Site'].isin(['CCAFS SLC-40','CCAFS LC-40'])].head()
#df.loc[~df['column_name'].isin(some_values)]
# SELECT * FROM table WHERE Launch_Site IS IN ('CCAFS SLC-40','CCAFS LC-40') LIMIT 5

,Date,Time (UTC),Booster_Version,Launch_Site,Payload,PAYLOAD_MASS__KG_,Orbit,Customer,Mission_Outcome,Landing _Outcome
5,29-09-2013,16:00:00,F9 v1.1 B1003,VAFB SLC-4E,CASSIOPE,500,Polar LEO,MDA,Success,Uncontrolled (ocean)
20,17-01-2016,18:42:00,F9 v1.1 B1017,VAFB SLC-4E,Jason-3,553,LEO,NASA (LSP) NOAA CNES,Success,Failure (drone ship)
28,14-01-2017,17:54:00,F9 FT B1029.1,VAFB SLC-4E,Iridium NEXT 1,9600,Polar LEO,Iridium Communications,Success,Success (drone ship)
29,19-02-2017,14:39:00,F9 FT B1031.1,KSC LC-39A,SpaceX CRS-10,2490,LEO (ISS),NASA (CRS),Success,Success (ground pad)
30,16-03-2017,06:00:00,F9 FT B1030,KSC LC-39A,EchoStar 23,5600,GTO,EchoStar,Success,No attempt

In [50]:
data['Mission_Outcome'].unique()

array(['Success', 'Failure (in flight)',
       'Success (payload status unclear)', 'Success '], dtype=object)

In [14]:
task2 = pd.read_sql_query("SELECT * FROM spacex WHERE launch_Site LIKE 'CCA%' LIMIT 5", con)
task2

,Date,Time_(UTC),Booster_Version,Launch_Site,Payload,PAYLOAD_MASS__KG_,Orbit,Customer,Mission_Outcome,Landing _Outcome
0,4/6/2010,18:45:00,F9 v1.0 B0003,CCAFS LC-40,Dragon Spacecraft Qualification Unit,0,LEO,SpaceX,Success,Failure (parachute)
1,8/12/2010,15:43:00,F9 v1.0 B0004,CCAFS LC-40,"Dragon demo flight C1, two CubeSats, barrel of...",0,LEO (ISS),NASA (COTS) NRO,Success,Failure (parachute)
2,22-05-2012,7:44:00,F9 v1.0 B0005,CCAFS LC-40,Dragon demo flight C2,525,LEO (ISS),NASA (COTS),Success,No attempt
3,8/10/2012,0:35:00,F9 v1.0 B0006,CCAFS LC-40,SpaceX CRS-1,500,LEO (ISS),NASA (CRS),Success,No attempt
4,1/3/2013,15:10:00,F9 v1.0 B0007,CCAFS LC-40,SpaceX CRS-2,677,LEO (ISS),NASA (CRS),Success,No attempt

### Task 3

##### Display the total payload mass carried by boosters launched by NASA (CRS)

In [17]:
task3 = pd.read_sql_query("SELECT Customer, SUM(PAYLOAD_MASS__KG_) as total_mass FROM spacex WHERE Customer = 'NASA (CRS)'", con)
task3

     Customer  total_mass
0  NASA (CRS)       45596

In [16]:
data.groupby('Customer')['PAYLOAD_MASS__KG_'].sum() # 45596

Customer
ABS Eutelsat                                                   7759
AsiaSat                                                        8963
Bulsatcom                                                      3669
CONAE                                                          3000
CONAE, PlanetIQ, SpaceX                                        3130
Canadian Space Agency (CSA)                                    4200
EchoStar                                                       5600
Es hailSat                                                     5300
Hisdesat exactEarth SpaceX                                     2150
Hispasat  NovaWurks                                            6092
Inmarsat                                                       6070
Intelsat                                                       6761
Iridium Communications                                        67200
Iridium Communications GFZ ‚ NASA                              6460
KT Corporation                                                 3500
MDA                                                             500
NASA (CCD)                                                    12055
NASA (CCDev)                                                  12530
NASA (CCP)                                                    12500
NASA (COTS)                                                     525
NASA (COTS) NRO                                                   0
NASA (CRS)                                                    45596
NASA (CRS), Kacific 1                                          2617
NASA (CTS)                                                    12050
NASA (LSP)                                                      362
NASA (LSP) NOAA CNES                                            553
NASA / NOAA / ESA / EUMETSAT                                   1192
NRO                                                            5300
NSPO                                                            475
Northrop Grumman                                               5000
Orbcomm                                                        3350
PSN, SpaceIL / IAI                                             4850
Republic of Korea Army, Spaceflight Industries (BlackSky)      5500
SES                                                           23355
SES EchoStar                                                   5200
SKY Perfect JSAT Group                                         9296
Sky Perfect JSAT, Kacific 1                                    6956
SpaceX                                                       185220
SpaceX, Planet Labs                                           31010
SpaceX, Planet Labs, PlanetIQ                                 15440
SpaceX, Spaceflight Industries (BlackSky), Planet Labs        14932
Spacecom                                                       6500
Spaceflight Industries                                         4000
Telesat                                                       14135
Telkom Indonesia                                               5800
Thaicom                                                        6425
Thales-Alenia/BTRC                                             3600
Turkmenistan National Space Agency                             4707
U.S. Air Force                                                 4990
U.S. Air Force NASA NOAA                                        570
U.S. Space Force                                               4311
USAF                                                           4400
USSF                                                           4311
Name: PAYLOAD_MASS__KG_, dtype: int64

### Task 4

##### Display average payload mass carried by booster version F9 v1.1

In [18]:
f9 = data.groupby('Booster_Version')['PAYLOAD_MASS__KG_'].mean()
f9['F9 v1.1']

2928.4

In [18]:
task4 = pd.read_sql_query("SELECT Booster_Version, SUM(PAYLOAD_MASS__KG_) as total_mass FROM spacex WHERE Booster_Version = 'F9 v1.1'", con)
task4

  Booster_Version  total_mass
0         F9 v1.1       14642

### Task 5

##### List the date when the first succesful landing outcome in ground pad was acheived.

*Hint:Use min function*

In [38]:
task5 = pd.read_sql_query("SELECT Landing_Outcome, MIN(Date) FROM spacex WHERE Landing_Outcome = 'Success (ground pad)'", con)
task5

        Landing_Outcome MIN(Date)
0  Success (ground pad)  1/5/2017

In [21]:
data.groupby('Landing _Outcome')['Date'].min() # 01-05-2017

Landing _Outcome
Controlled (ocean)        11-02-2015
Failure                   05-12-2018
Failure (drone ship)      04-03-2016
Failure (parachute)       04-06-2010
No attempt                01-03-2013
No attempt                06-08-2019
Precluded (drone ship)    28-06-2015
Success                   02-03-2019
Success (drone ship)      06-05-2016
Success (ground pad)      01-05-2017
Uncontrolled (ocean)      21-09-2014
Name: Date, dtype: object

### Task 6

##### List the names of the boosters which have success in drone ship and have payload mass greater than 4000 but less than 6000

In [45]:
task6 = pd.read_sql_query("""SELECT Booster_Version, PAYLOAD_MASS__KG_, Landing_Outcome FROM spacex 
                            WHERE Landing_Outcome = 'Success (drone ship)' AND
                          PAYLOAD_MASS__KG_ BETWEEN 4000 AND 6000 
                          GROUP BY Booster_Version LIMIT 4""", con)
task6

  Booster_Version PAYLOAD_MASS__KG_       Landing_Outcome
0  F9 FT  B1021.2              5300  Success (drone ship)
1  F9 FT  B1031.2              5200  Success (drone ship)
2     F9 FT B1022              4696  Success (drone ship)
3     F9 FT B1026              4600  Success (drone ship)

In [42]:
#df.loc[(df['column_name'] >= A) & (df['column_name'] <= B)]

four_to_six_k = data.loc[(data['PAYLOAD_MASS__KG_'] > 4000) & (data['PAYLOAD_MASS__KG_'] < 6000)]
four_to_six_k.loc[four_to_six_k['Landing _Outcome'] =='Success (drone ship)'].groupby(['Booster_Version','Landing _Outcome'])['Mission_Outcome'].sum()

Booster_Version  Landing _Outcome
F9 FT  B1021.2   Success (drone ship)    Success
F9 FT  B1031.2   Success (drone ship)    Success
F9 FT B1022      Success (drone ship)    Success
F9 FT B1026      Success (drone ship)    Success
Name: Mission_Outcome, dtype: object

### Task 7

##### List the total number of successful and failure mission outcomes

In [46]:
task7 = pd.read_sql_query("""SELECT Mission_Outcome, COUNT(Mission_Outcome) as total from spacex GROUP BY Mission_Outcome""", con)
task7

                    Mission_Outcome  total
0               Failure (in flight)      1
1                           Success     98
2                          Success       1
3  Success (payload status unclear)      1

In [47]:
data.groupby('Mission_Outcome')['Landing _Outcome'].count() # 100

Mission_Outcome
Failure (in flight)                  1
Success                             98
Success                              1
Success (payload status unclear)     1
Name: Landing _Outcome, dtype: int64

### Task 8

##### List the   names of the booster_versions which have carried the maximum payload mass. Use a subquery

In [47]:
task8 = pd.read_sql_query("""SELECT Booster_Version
                            FROM spacex WHERE PAYLOAD_MASS__KG_ = (SELECT MAX(PAYLOAD_MASS__KG_) FROM spacex)""", con)
task8

  Booster_Version
0   F9 FT B1029.1
1   F9 FT B1036.1
2   F9 B4 B1041.1
3  F9 FT  B1036.2
4  F9 B4  B1041.2
5    F9 B5B1048.1
6   F9 B5 B1049.2

In [48]:
task8a = pd.read_sql_query("""SELECT Booster_Version
                            FROM spacex WHERE PAYLOAD_MASS__KG_ = 15600""", con)
task8a

   Booster_Version
0    F9 B5 B1048.4
1    F9 B5 B1049.4
2    F9 B5 B1051.3
3    F9 B5 B1056.4
4    F9 B5 B1048.5
5    F9 B5 B1051.4
6    F9 B5 B1049.5
7   F9 B5 B1060.2
8   F9 B5 B1058.3
9    F9 B5 B1051.6
10   F9 B5 B1060.3
11  F9 B5 B1049.7

In [51]:
max_payload = data['PAYLOAD_MASS__KG_'].max()
max_payload

15600

In [53]:
booster_max = data.loc[(data['PAYLOAD_MASS__KG_'] == 15600)]
booster_max['Booster_Version'].unique()

array(['F9 B5 B1048.4', 'F9 B5 B1049.4', 'F9 B5 B1051.3', 'F9 B5 B1056.4',
       'F9 B5 B1048.5', 'F9 B5 B1051.4', 'F9 B5 B1049.5',
       'F9 B5 B1060.2 ', 'F9 B5 B1058.3 ', 'F9 B5 B1051.6',
       'F9 B5 B1060.3', 'F9 B5 B1049.7 '], dtype=object)

### Task 9

##### List the failed landing_outcomes in drone ship, their booster versions, and launch site names for the in year 2015

In [52]:
task9 = pd.read_sql_query("""SELECT Date, Landing_Outcome, Booster_Version, Launch_Site
                            FROM spacex 
                            WHERE date LIKE '%2015' AND Landing_Outcome LIKE '%(drone ship)'""", con)
task9

         Date         Landing_Outcome Booster_Version  Launch_Site
0   10/1/2015    Failure (drone ship)   F9 v1.1 B1012  CCAFS LC-40
1  14-04-2015    Failure (drone ship)   F9 v1.1 B1015  CCAFS LC-40
2  28-06-2015  Precluded (drone ship)   F9 v1.1 B1018  CCAFS LC-40

In [57]:
data['Date']= pd.to_datetime(data['Date'])

In [60]:
data['Date'].head()

0   2010-04-06
1   2010-08-12
2   2012-05-22
3   2012-08-10
4   2013-01-03
Name: Date, dtype: datetime64[ns]

In [61]:
year_2015 = data.loc[(data['Landing _Outcome'] == 'Failure (drone ship)') & (data['Date'] >= '2015-01-01') & (data['Date'] < '2016-01-01')]

In [67]:
group_2015 = year_2015.groupby(['Landing _Outcome','Launch_Site','Booster_Version'])
for key, item in group_2015:
    print(group_2015.get_group(key))

         Date Time (UTC) Booster_Version  Launch_Site       Payload  \
13 2015-10-01   09:47:00   F9 v1.1 B1012  CCAFS LC-40  SpaceX CRS-5

    PAYLOAD_MASS__KG_      Orbit    Customer Mission_Outcome  \
13               2395  LEO (ISS)  NASA (CRS)         Success

        Landing _Outcome
13  Failure (drone ship)
         Date Time (UTC) Booster_Version  Launch_Site       Payload  \
16 2015-04-14   20:10:00   F9 v1.1 B1015  CCAFS LC-40  SpaceX CRS-6

    PAYLOAD_MASS__KG_      Orbit    Customer Mission_Outcome  \
16               1898  LEO (ISS)  NASA (CRS)         Success

        Landing _Outcome
16  Failure (drone ship)

### Task 10

##### Rank the count of landing outcomes (such as Failure (drone ship) or Success (ground pad)) between the date 2010-06-04 and 2017-03-20, in descending order

In [63]:
task10a = pd.read_sql_query("""SELECT Date
                            FROM spacex 
                           """, con)
task10a

           Date
0    2010-04-06
1    2010-08-12
2    2012-08-10
3    2013-01-03
4    2013-03-12
..          ...
96   2020-05-30
97   2020-06-30
98   2020-08-30
99   2017-10-30
100  2018-01-31

[101 rows x 1 columns]

In [70]:
task10 = pd.read_sql_query("""SELECT Landing_Outcome, COUNT(Landing_Outcome) as Total
                            FROM spacex 
                            WHERE DATE(Date) BETWEEN DATE("2010-06-04") AND DATE("2017-03-20")
                            GROUP by Landing_Outcome ORDER BY Total DESC""", con)
task10

          Landing_Outcome  Total
0              No attempt     10
1    Success (drone ship)      5
2    Failure (drone ship)      5
3    Success (ground pad)      4
4      Controlled (ocean)      3
5    Uncontrolled (ocean)      1
6  Precluded (drone ship)      1
7     Failure (parachute)      1

In [73]:
year_10_17 = data.loc[(data['Date'] >= '2010-06-04') & (data['Date'] < '2017-03-20')]

group_10_17 = year_10_17.groupby(['Landing _Outcome'],as_index=False).size()

In [74]:
group_10_17

         Landing _Outcome  size
0      Controlled (ocean)     3
1    Failure (drone ship)     5
2     Failure (parachute)     1
3              No attempt    10
4  Precluded (drone ship)     1
5    Success (drone ship)     5
6    Success (ground pad)     5
7    Uncontrolled (ocean)     2

### Reference Links

*   <a href ="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20String%20Patterns%20-%20Sorting%20-%20Grouping/instructional-labs.md.html?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDS0321ENSkillsNetwork26802033-2021-01-01&origin=www.coursera.org">Hands-on Lab : String Patterns, Sorting and Grouping</a>

*   <a  href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20Built-in%20functions%20/Hands-on_Lab__Built-in_Functions.md.html?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDS0321ENSkillsNetwork26802033-2021-01-01&origin=www.coursera.org">Hands-on Lab: Built-in functions</a>

*   <a  href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20Sub-queries%20and%20Nested%20SELECTs%20/instructional-labs.md.html?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDS0321ENSkillsNetwork26802033-2021-01-01&origin=www.coursera.org">Hands-on Lab : Sub-queries and Nested SELECT Statements</a>

*   <a href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Module%205/DB0201EN-Week3-1-3-SQLmagic.ipynb?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDS0321ENSkillsNetwork26802033-2021-01-01">Hands-on Tutorial: Accessing Databases with SQL magic</a>

*   <a href= "https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Module%205/DB0201EN-Week3-1-4-Analyzing.ipynb?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDS0321ENSkillsNetwork26802033-2021-01-01">Hands-on Lab: Analyzing a real World Data Set</a>

## Author(s)

<h4> Lakshmi Holla </h4>

## Other Contributors

<h4> Rav Ahuja </h4>

## Change log

| Date       | Version | Changed by    | Change Description        |
| ---------- | ------- | ------------- | ------------------------- |
| 2021-08-24 | 0.3     | Lakshmi Holla | Added library update      |
| 2021-07-09 | 0.2     | Lakshmi Holla | Changes made in magic sql |
| 2021-05-20 | 0.1     | Lakshmi Holla | Created Initial Version   |

## <h3 align="center"> © IBM Corporation 2021. All rights reserved. <h3/>